=== Work__Gym
~   Flag__Work__Gym ++
去健身
————————————————
健身房改名，并变为健身实验基地。
前台的人也换了，他们都穿着一样的胶衣。
觉得不是很对劲，但是这个健身房的味道挺好闻。
来了一个新的健身教练。
这个教练给了新的训练服。
说是在研发的科技辅助装备。
穿上之后觉得不对劲。
自动凝聚成护膝，要我下跪。
这不可能！
我不会接受的！不要！





如同会员认真的听讲一般

从脚底的阴影伸出的触手扯着我的身体把我按在地上




AZ 不紧不慢地走到你的面前，用他滑落着胶液的触手摸在了你的头顶上。
温暖的感觉像是某种你所缺失许久的感情，是安心么？你嫌弃又难以置信地扭动着自己的脑袋，但是 AZ 那不容质疑的怪量又将你的头颅死死地限制在了原处动弹不得。
你感觉到脸颊上有粘稠的液体流下，更要命的是，你的耳朵听到了某种诡异的水声，就像是买来的章鱼在有水的案板上扭动发出的啪嗒声……
你紧张地转动着自己的眼球，可眼前就除了席地而坐、表情虔诚的“会员”外还是“会员”。
随着两边耳朵“嗵”的一声巨响伴随着剧痛，你的耳膜和头骨轻易地就被从 AZ 手上伸出的触手戳碎了。但很快，在那股剧痛被更为炽热的某样你不用去想象的流体覆盖了之后，就只剩下了酥酥麻麻的舒爽，突如其来的意外多巴胺让你的眼瞳不禁地往上飘了上飘……而那个些糟糕的东西则捅入了更深的某个地方……
骨传导仍然让你听到了来自你头颅内部的粘稠声响，把你的记忆和视觉搅合的乱七八糟。
你发现……眼前的世界正在随着触手的搅动而倒流……你看到了你刚才进健身房的时候……你看到了今天早上去上班的时候……你看到了前天在打《狗熊联盟》的时候……去年的今天……前年……三年前……
————————————————
随着触手越戳越深，你突然像是想起来什么……
“不……要……”
“嗯？”AZ 虽然哼了一声，但是触手并没有因此停下。
那一瞬间，触手就已经戳穿了某个你已经主动遗忘的封存记忆。
（扭曲的童年时期）
从那以后，你就变得非常的独立，你难以再相信任何人，更是厌恶扯上与亲属有关的一切。
只是你将这一切都封存了起来，永远地埋藏在了心里。
————————————————
“不！要！再！看！我！的！过！去！”
泪水已经控制不住，这部分连你自己都不愿意主动回忆的“黑历史”如今被一个恶心的异形强制获取。着让你羞愧又气恼。正是因为你主动的遗忘掉了让你痛苦不堪的回忆才得以让你轻松地活到今天。
你的肾上腺素狂飙，血压也随之增加。可是又有另一种不属于你神经的调控在压制着你的生理反应，想让你冷静下来。
你的脑子已经变得乱糟糟的，最终身体已经透支了所有的能量。突然一个眩晕的感觉涌现上来，如同本人抡了一棍，你就这样在 AZ 的面前一下子晕了过去。
而突然失去了对抗处理的数据洪流瞬间裹挟了你的大脑。
->  Game_Over
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
=   Game_Over
~   Count__Game_Over ++
{
-   Flag__Work__Gym == 1:
    ~   INDEX = INDEX + 10
-   else:
    ~   INDEX = INDEX + 5
}
<-  Page__Endings.Ending__Work__Gym
->  Menu__Game_Over