=== Navigator
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
=   Index
{
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
//  初次启动故事
-   INDEX == -1:
    ————————————————
    每天被闹钟叫醒的你，第一个想法都是在下意识的地在思考“人为什么要上班”这个问题……
    （是啊……为什么呢……）你睁开了眼睛，坐起来按掉了闹钟。
    作为一只猫科猛兽种，无亲无故的你靠着自己的打拼买到了自己的小房子，因此也背上了甜蜜的贷款……
    你觉得自己的生活刚刚起步，还有很多想要的东西没有得到，还有……唉，太多了。然而他们都离不开那个俗气但又是必不可少的东西——钱。
    ————————————————
    “哈欠……这种日子……什么时候是个头啊……”你伸了伸懒腰下了床。然后来到卫生间清理着自己的毛发。
    自信的微笑浮现在镜子中的黄色老虎兽人脸上——你感觉今天的自己也充满了活力。
    ————————————————
    距离上班得时间还早。
    嘴里一边叼着刚做的早餐，一边检查着私人邮箱：
    （嗯……黑川物流的面试邀请邮件啊。）
    作为一家物流公司的市场部部长，你的私人邮箱就如同你自己的住址一样保护的很好，能送进来的信绝大部分都不是垃圾邮件。
    ————————————————
    其实……你并不喜欢你现在所在的这家物流公司。
    作为那家公司的元老级人物，你亲手带领团队“打死”了一家又一家的竞争对手。可却连个股份都分不到，到现在都还是拿着死工资……
    （好机会，看看吧……）于是你打开邮件。    
    <-  KKL_Letter
    ————————————————
    “NICE!”
    虽说你还算是个年轻的家伙，但坐在物流公司的市场部部长这个位置还是让你遍尝世间百态，心理也不再稚嫩纯真……不过这不妨碍自己“被认可”时的小小喜悦。
    ————————————————
    尽管今天就可以请假去面试，不过这件事情也不是很急，更何况他们已经明说了随时都可以去做这件事。如果去面试的话就要请出一天假期。
    而今天的精神状态这么好，肯定能把任务很快地完成，下午愉快地摸鱼鱼，晚上还能去健身房锻炼，听起来就很完美。
    公司里应该还有需要做的事情，你也需要一点时间来把想要保留工作内容、个人资料还有想要转交内容都准备准备，免得突然在你跳槽之前就被这傻逼公司开了。
    那么今天……
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
//  精神即将崩溃，就想呆在家
-   Check__SAN(INDEX) == "AWFUL":
    那里也不想去。就想呆在家里，感觉精神慌慌的。觉得今天外面的世界要毁灭。
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
//  BAD：没有都做过的可能，因为那会直接进去真结局
////////////////////////////////
//  BAD：上终, 电影
-   Check__SAN(INDEX) == "BAD" and Flag__Work__Shutdown != 0 and Flag__Break__Cinema != 0 and Flag__Break__Home == 0:
    天王老子来了也不会去上班的。
    今天就想在家呆着。
////////////////////////////////
//  BAD：上终, 快递
-   Check__SAN(INDEX) == "BAD" and Flag__Work__Shutdown != 0 and Flag__Break__Cinema == 0 and Flag__Break__Home != 0:
    今天就是天王老子来了也不去上班。今天可是首映，出去走走呼吸新鲜空气。
////////////////////////////////
//  BAD：电影, 快递
-   Check__SAN(INDEX) == "BAD" and Flag__Work__Shutdown == 0 and Flag__Break__Cinema != 0 and Flag__Break__Home != 0:
    谁还不是吊着一口气呢……虽然想休息，但是觉得公司还有事情做，不如还是去上班吧。
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
//  BAD：只收过快递
-   Check__SAN(INDEX) == "BAD" and Flag__Work__Shutdown == 0 and Flag__Break__Cinema == 0 and Flag__Break__Home != 0:
    精神不太好，但是还是可以去上班……不过今天是某个电影的首映，出去走走呼吸新鲜空气。
////////////////////////////////
//  BAD：只看过电影
-   Check__SAN(INDEX) == "BAD" and Flag__Work__Shutdown == 0 and Flag__Break__Cinema != 0 and Flag__Break__Home == 0:
    可以上班，但是更想在家里休息，首映会什么的就以后看回放也无所谓。
////////////////////////////////
//  BAD：只读过上终
-   Check__SAN(INDEX) == "BAD" and Flag__Work__Shutdown != 0 and Flag__Break__Cinema == 0 and Flag__Break__Home == 0:
    今天就是天王老子来了我也不会去上班。我今天就要休息。
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
//  BAD 三件事都可以去，小憩是否不影响，所以在这里。
-   Check__SAN(INDEX) == "BAD" and Flag__Work__Shutdown == 0 and Flag__Break__Cinema == 0 and Flag__Break__Home == 0:
    感觉精神不太好。倒是可以去上班。不过如果休息一下也许会更好。
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
//  OK：三个 OK 的事件都做了
-   Check__SAN(INDEX) == "OK" and Flag__Work__Business_Trip != 0 and Flag__Work__Off_Work != 0 and Flag__Break__Interview != 0:
    <-  KKL_Letter
    去上班或者就任性地请假一天去休息，出门找人玩？我想起今天时超好看的电影的首映会。
    好纠结呢……
////////////////////////////////
//  OK：三个 OK 的事件都没做
-   Check__SAN(INDEX) == "OK" and Flag__Work__Business_Trip == 0 and Flag__Work__Off_Work == 0 and Flag__Break__Interview == 0:
    <-  KKL_Letter
    感觉今天有一种巨大的压力，有什么东西在一直盯着我……似乎是有太多该做的事情没做了。
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
//  OK：仅没面试
-   Check__SAN(INDEX) == "OK" and Flag__Work__Business_Trip != 0 and Flag__Work__Off_Work != 0 and Flag__Break__Interview == 0:
    <-  KKL_Letter
    觉得今天去公司也没啥事情做，要不就请假去面试吧。以今天的精神状态，硬点一天出来休息还是有点矫情了，至少还是做点神什么。
////////////////////////////////
//  OK：仅没出差
-   Check__SAN(INDEX) == "OK" and Flag__Work__Business_Trip == 0 and Flag__Work__Off_Work != 0 and Flag__Break__Interview != 0:
    <-  KKL_Letter
    感觉公司还有事情要做，面试可以先缓缓。
////////////////////////////////
//  OK：仅没下班
-   Check__SAN(INDEX) == "OK" and Flag__Work__Business_Trip != 0 and Flag__Work__Off_Work == 0 and Flag__Break__Interview != 0:
    <-  KKL_Letter
    感觉这公司没想有想象的靠谱。改天吧，也许在公司还有事情做，不如去公司。以今天的精神状态，硬点一天出来休息还是有点矫情了。
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
//  OK：只面试过
-   Check__SAN(INDEX) == "OK" and Flag__Work__Business_Trip == 0 and Flag__Work__Off_Work == 0 and Flag__Break__Interview != 0:
    <-  KKL_Letter
    莫名的感觉这家公司不靠谱，算了吧。
////////////////////////////////
//  OK：只下班过
-   Check__SAN(INDEX) == "OK" and Flag__Work__Business_Trip == 0 and Flag__Work__Off_Work != 0 and Flag__Break__Interview == 0:
    <-  KKL_Letter
    去面试还是去上班呢？
////////////////////////////////
//  OK：只出差过
-   Check__SAN(INDEX) == "OK" and Flag__Work__Business_Trip != 0 and Flag__Work__Off_Work == 0 and Flag__Break__Interview == 0:
    <-  KKL_Letter
    今天可以去面试，但是最近公司想要搞大动作，不知道会不会有什么需求。
////////////////////////////////
//  OK：其它
-   Check__SAN(INDEX) == "OK":
    OK【这个情况似乎没有考虑到】
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
//  FINE：已健身、下班
-   Check__SAN(INDEX) == "FINE" and Flag__Work__Gym != 0 and Flag__Work__Off_Work != 0:
    <-  KKL_Letter
    去上班还是去面试都行，感觉今天精神虽然不错，但是心里乱糟糟的。
////////////////////////////////
//  FINE：已下班
-   Check__SAN(INDEX) == "FINE" and Flag__Work__Gym == 0 and Flag__Work__Off_Work != 0:
    <-  KKL_Letter
    感觉今天身体充满了力气，下班去健身房吧。
////////////////////////////////
//  FINE：已健身
-   Check__SAN(INDEX) == "FINE" and Flag__Work__Gym != 0 and Flag__Work__Off_Work == 0:
    <-  KKL_Letter
    不过面试要请假丢一天假期。精神虽然不错，但是感觉自己身体有点酸软，还没到需要请假的地步，要不还是去上个班，下午在工位摸鱼也算恢复体力了。如果下班了身体也恢复了……那也许晚上还能努努力去个健身房？
////////////////////////////////
//  FINE：其它的 FINE
-   Check__SAN(INDEX) == "FINE":
    <-  KKL_Letter
    去上班吧～
    今天感觉状态很好，晚上还能去健身。
////////////////////////////////
//  其它没有考虑到的情况
-   else:
    ->  BUG
}
->  Base__Going_To
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
=   KKL_Letter
{
////////////////////////////////
//  完整内容
-   INDEX == -1:
    ~   INDEX ++
    ————————————————
    ～～～～～～～～～～～～～～～～
    您好，洛书，
    感谢您投递的简历，以及您对黑川物流的关注。
    您深厚的行业背景和卓越的市场部管理经验给我们留下了深刻的印象。我们相信，您的加入将为公司带来巨大的能量。
    我们非常欢迎您来公司面试。请您在工作时段（周一至周五的 9:00 到 17:00）中的任何时间，随时到访公司即可。
    我们期待与您见面。
    此致，
    ——黑川物流人事部
    ～～～～～～～～～～～～～～～～
////////////////////////////////
//  OK 的信
-   Check__SAN(INDEX) == "OK":
    OK 时的信。有一点点想请假。
    【DEV】去不去面试由导航器判定。
////////////////////////////////
//  FINE 时的信。
-   Check__SAN(INDEX) == "FINE":
    FINE 时的信。
    面试可以去，但是会公司请假一请就是一天，会空休息半个下午。
////////////////////////////////
//  其它
-   else:
    ->  BUG
}
->  DONE