=== Work___Index
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
【DEV】上班了 {Work___Index} 次
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
{
-   Index == 0:
    #   CLEAR
    你觉得你今天最好还是去上班。
    ————————————————
    良好的精神状态让你不知不觉中就已经到公司了。
    （来看看今天的任务……）你打开内部网络的通讯系统，检查着今天的待办事项。
    （嗯……市场部日常报表总结……攻击对手……看来没啥特别的事情）
    你继续翻阅着消息。
    “啊……出差？我？”你有点难以置信地点开邮件，然而里面的内容却让你无奈地笑笑摇摇头——原来，只是需要一个人把一些材料亲自当面递交到隔壁市的一个政府机关中。
    “这也叫出差……还要我去？”正不以为然的时候，你发现了邮件下面老板批注：
    “文件比较重要还得有管事的人去办。这几天找空闲的时间去都可以。我给你一天时间。”
    （特么的老登你咋不自己去呢？天天闲的B事没有。）你心里暗自骂了老板一千遍。不见面的内部通讯系统对双方的这点“好处”就体现出来了。
    但老板都那么说了，去了的话就等于你可以找个借口小小的休假半天，放松一下也好。
    不过，今天的你感觉精力充沛！并不需要休息。甚至下班之后有足够的精神去健身房里去健身撸铁。
    那么，现在要做点什么呢？
    +   [正常完成市场部的工作]
        ->  Daily
    +   把今天的工作置之脑后并出差  #   unclickable
        TODO    开局出差
        ->  Work___Business_Trip
}
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
=   Daily
#   CLEAR
（好吧～出差的事情缓一缓也没有关系。）
你决定今天就在公司完成任务，这样还能有时间去悄悄收拾一下自己的文件和资料。
————————————————
你打开了工作收件箱，查阅着今天要攻击的对象。
“这是……”虽然你料想过这样的事情，但真正发生的时候还是觉得造化弄人。
是的，今天，你要着手准备攻击的对象正是黑川物流。
但是没有办法，你现在仍然是这家物流公司的人，那么黑川物流就是你的对手。
不过，你可以暗地里让自己的攻击速度减慢一些，至少在自己离开前都不会让这次的攻击真正的生效。
要是有人问起来，就说对方防御充分，没有那么容易攻击。（尽管你很清楚黑川物流根本就没有市场部）
————————————————
上午很快就过去了，你也很快就搞定了所有的任务。
现在的奥义就是“装忙”。刚好，你也有合理的用来装忙的事情做。
——你可以用这个时间好好收拾一下你的文件。（甚至……还可以悄悄地带走点什么。）
————————————————
不知不觉，下午也已经过去了。吃饭下班……
————————————————
是的。作为一个社畜来说，工作日的生活就是如此的平平无奇、枯燥且千篇一律。
概括一下确实是无聊的。没有运动，也并没有休息。
看似做了一天的产出，但是感觉并没有什么东西是真切地落到实处或者是为了自己而做。
————————————————
{
-   Index < 30:
    好在，今天的精神还是很不错的。如果就这样回家，多余的精力怕是也难以消耗。更何况，你自己还有一个“成为猛汉”的小目标。
    你轻轻地捏着自己相对扎实的臂膀，思考着今天接下来做什么。
    +   [去健身！我要变大！]
        ->  Work__Gym
    +   犯懒了……回家歇着吧  #   unclickable
        TODO    回家当猫猫虫
        ->  Work__Off_Work
-   else:
    ->  BUG
}




















/*
{
-   Work___Business_Trip && Work__Gym && Work__Off_Work && Work__Napping:
    ->  Work__Fatality
-   else:
    ->  Work___Index.Morning
}
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
=   Morning
去上班的走向。
有出差的事情可以今天做，今天下雨。（出差也不是很急）
（出差了 {Work___Business_Trip} 次）
////////////////////////////////
{   Work___Business_Trip == 0 && Index >= 0 && Index < 30:
    精神状态不错！无所谓是否出差。
    +   出去出差
        ->  Work___Business_Trip
    +   下次一定
        ->  Work___Index.Work__Working
}
////////////////////////////////
{   Work___Business_Trip == 0 && Index >= 30:
    精神状态一般虽然不想出差，但还是得完成工作啊。
    +   出去出差吧
        ->  Work___Business_Trip
    +   下次一定
        ->  Work___Index.Work__Working
}
////////////////////////////////
{   Work___Business_Trip >= 1:
    隐约感觉去出差可能会出事。
    +   还是出去出差
        ->  Work___Business_Trip
    +   下次一定
        ->  Work___Index.Work__Working
}
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
=   Work__Working
老老实实的完成市场部的任务
{   
-   Index >=30:
    好困。
    +   睡着
        ->  Work__Napping
    +   撑住。
        ->  Work__After_Work
-   else:
    ->  Work__After_Work
}
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
////////////////////////////////
=   Work__After_Work
下班。
{   Index >= 0 && Index < 30:
TODO    还要判定是第几次
    觉得今天很巴适，想去健身房。
+   去健身
    ->  Work__Gym
+   懒了，还是下班回家吧
    ->  Work__Off_Work
}
////////////////////////////////
{   Index >= 30:
    觉得没有精神，直接回家。
    ->  Work__Off_Work
}





*/