=== 1_Start
“哇啊啊啊啊啊啊！！！！你们不要过来啊”
魔法使夏天正被一群黑胶狼群追赶着，手中精致的法阵反而显得十分累赘。
->  Choose1
    =   Choose1
    *   [喵的，和你们爆了]
            事已至此也没法想到其他的办法，和胶狼群的距离过进恐怕在法术释放之前就会被撕成碎片。
            “早就知道让赫德莱特他们自己解决了”
            魔法使的体力明显远不如胶狼群，夏天拿起悬挂在身上的笔记本，焦急的翻阅着可用的办法：“早就知道实战课不旷了，女神大人救救我啊啊！”
            不幸的，自己慌不择路的逃跑反而让自己闯入了密林区，前面的景象被大片的高大植物覆盖，别说是路了，前面会发生什么都是笔记中未记载的事情，自己只能随机应变了。
            ->  Choose2
    *   你给路大有（逃跑）
            TODO
            （还没有开发。）
            ->  Choose1
    *   累了，不干了
                TODO
            （还没有开发。）
            ->  Choose1
    =   Choose2
        *   就地取材，躲起来
                TODO
                （还没有开发。）
                ->  Choose2
        *   躲不了了，开打吧
                TODO
                （还没有开发。）
                ->  Choose2
        *   接着跑
                ->  1_Keep_Running
                
=== 1_Keep_Running
不跑就只能在这里等死了，夏天一头钻进茂盛的树林之中，层层叠叠的树丛让自己辨别不了方向，但身后胶狼群的咆哮迫使自己像只无头苍蝇一样到处乱撞。
扒开重叠挡路的树丛，自己突然没踩稳摔倒在地上，这里似乎是什么高级生物的领地，周围的植被光秃形成一旁怪异的空地。
夏天尝试着爬起，脚踝扭伤的剧痛让自己再次摔倒，自己抓起法杖一瘸一拐的穿过这片空地，猎物受伤的血腥味明显激起狼群的野性，自己只能酿酿跄跄的被迫迎战。
狼群看着受伤的猎物，一只带头的胶狼猛然扑上前试图咬住夏天的胳膊，但是被挣扎着的夏天踹开。
————————————————
就在双方对峙的时候，空地的中心突然出现一个庞然大物，物体是生产产生了强劲的冲击波，将夏天和狼群震开，领头的头狼距离太近身体被震的四分五裂，夏天也好不到哪里去，被震开的他头部和后背猛的撞在树桩上，血液顺着额头流下，自己只能迷迷糊糊的看着面前的东西……
印着黑川物流的胶囊舱突然出现在异世界的大陆中，看着将首领震碎，被击退的狼群们看着这个胶囊舱有些胶狼警惕的后退，也有一些向着胶囊舱咆哮着，有个不怕死的胶兽跑上去撕咬着舱门，牙齿和金属摩擦发出让人不适的声音，猛然的，舱门被内部踹开，飞出的铁板不幸的碾碎了撕咬舱门的胶狼的头颅，从胶囊舱中钻出一只全身被黑胶包裹，脸部被怪异面罩遮住，身上插着管子的……黑豹？
“发现威胁”身为黑豹的你说着奇怪的语言，扫视了一眼胶狼群，手上的黑胶聚合成锐利的爪刃，毫不留情的将靠过来的胶狼撕碎，狼群看着打不过这个“怪物”，夹着尾巴逃走了。
身为黑豹的你走了过来，看着想尽办法将自己隐藏起来的夏天，白狼原型整洁的毛发，现在与血液和泥土混成一团。
->  Choose1
    =   Choose1
        *   待在夏天身边，等他恢复
                TODO
                （还没有开发。）
                ->  Choose1
        *   [将他背起来，寻找救援]
                身为黑豹的你看夏天现在这样不省人事的样子，还是觉定先带他去找救援，你背起夏天收起身上滴落的黑胶，朝着可能有人的方向走去。
                昏死过去的白狼被你——瓦坎达背着，离开了比较危险的地方，不知道走了多久之后，你——瓦坎达隐隐约约的听到两个人推搡埋怨的声音，不过因为语音不通自己并没有过去。
                ->  Choose2
        *   释放自己的欲望将他吞噬
                TODO
                （还没有开发。）
                ->  Choose1
        *   将夏天吞入自己的身体，用黑胶疗伤
                TODO
                （还没有开发。）
                ->  Choose1
    =   Choose2
        你只看到红龙和蓝狐往这边走过来。
        *   [大概是他的同伴，把夏天放这里]
                你将夏天放在这里，确定他们能找到夏天之后打算离开。
                他们在找到夏天之后发现了你，并示意你和他们一起走。
                虽然双方语言不通，但是你能感到对方对自己的感谢，在路上，你翻阅着他们的笔记之类的书籍理解着这里的语言与文化。
                ->  1_Put_XiaTian_Down
        *   走出去把夏天交给他们
                TODO
                （还没有开发。）
                ->  Choose2
        *   把两个人打晕绑起拷问
                TODO
                （还没有开发。）
                ->  Choose2
        *   当着两个人的面同化夏天
                看着匆匆走过的两个，你也不确定对方是敌是友，最好的办法就是增加同伴将他们两个捕获，而目前能够同化的人只有背后的夏天。
                你将夏天暂时放在地上，解开了身上的作战装备，覆盖在脸上的面罩脱落，你将夏天抱起，撕破他的衣服，下身的大包也随之解锁，弹出粗大的胶液肉棒，肉棒抵在夏天未曾被开发过的后穴，在试探过后猛的插入其中。
                “唔啊！”
                后穴撕裂的疼痛让夏天惊醒，并发出一声惨叫，为了防止他过激反应，你捏住他的嘴，强行和他舌吻，黑胶长舌插入喉管，强行注入营养液与黑胶，下半身抽查着，加速他同化的速度。
                “什么人！干什么！”
                那两人听到夏天的惨叫，匆匆的赶过来掏出武器对着你——瓦坎达。
                红龙为蓝狐施加祝福后操控着风元素切割着瓦坎达。
                红龙为大剑附着着龙焰朝着他劈砍，你只能在注入胶液的同时躲避着两个人的攻击，不过有着被同化一半的夏天在，这两个人工具有所收敛。
                正当你——瓦坎达试图逃跑的时候，你感到身体的温度被一点点夺走，你朝下一看，半胶兽化的夏天尽可能的保持着清醒，吟唱着咒语：
                ——禁咒【结晶炼狱】——
                以自己的心脏为中心，寒冰冻结着身体的每一寸地方……
                ->  1_End1
            
            
=== 1_Put_XiaTian_Down
————————————————
在稍加学习此处的语言加上吸收部分原住民的血液样本，现在自己已经差不多能够读懂这里的语音。
（你）瓦坎达：“按你们这边来说，吟游诗人应该会基础的治疗术之类吧？”
（红龙）迟宴：“……”
（蓝狐）赫德莱恩：“抱歉，他把点数全加在别的攻击性技能上了，治疗的都没有学……”
（你）瓦坎达：“那你们平时……”

（蓝狐）赫德莱恩：“夏天他……基本上学会了大多数魔法，也就是说，如果不用战斗，其他治愈类法术都要靠他，现在他受伤昏过去了，也就是说……”
（蓝狐）赫德莱恩：“我们没办法用传送魔法回去了”
（蓝狐）赫德莱恩：“不过好消息是，在附近有据点可以休息，坏消息是距离我们最近的城镇还有一天的路程，所以，抱歉了，还得让你等一天”
到达据点后，你将夏天放在干净的地面上，赫德莱恩与笨拙的给夏天打上了绷带，最好有用吧……
天色已晚，
->  Choose1
    =   Choose1
    *   与赫德莱恩守夜
            TODO
            （还没有开发。）
            ->  Choose1
    *   在篝火旁陪着迟宴
            TODO
            （还没有开发。）
            ->  Choose1
    *   看着受伤的夏天
            TODO
            （还没有开发。）
            ->  Choose1
            
    *   [什么都不做，尝试联系黑川物流]
            你找个安静的角落坐着，尝试与黑川物流网络链接……
            几分钟过去后，意识网络并没有找到公司的信号，这个世界似乎与公司完全的断开了链接。那些肆意生长的黑胶生物估计就是因为这个原因所以如此猖狂吧。
        **  [睡觉]
                既然已经无法回去了，那就只能留在这里了，明天开始就要为生存而焦虑了。
                你走到夏天休息的地方蹲下，身上杂乱的绷带让你感到头疼。
                    ->  Choose2
    =   Choose2
        *   [给他重新包扎]
                ->  1_Rebandage_XiaTian
        *   让他见识一下黑胶科技
                TODO
                （还没有开发。）
                ->  Choose2
        *   手欠的摸他
                TODO
                （还没有开发。）
                ->  Choose2

=== 1_Rebandage_XiaTian
明显，这两个人的手艺完全不靠谱，你只能将他身上的绷带一点点拆开，重新包扎。
对于他的腿部，因为缺乏材料，你只能用部分身上的黑胶敷在上面来防止伤口开裂感染。
“你这个小家伙能活到现在还挺神奇。”
在处理完最后一处伤口后，你打了个哈欠推到房间的另一边休息。
“谢谢你。”角落的白狼随口说了一句之后就没了动静。
【获得技能】简易治疗术
————————————————
第二天，夏天已经差不多清醒了，正睡眼惺忪的蹲在火堆处掏着火堆。
“瓦坎达先生，你醒了？”赫德莱恩招呼着你过去吃早餐。
（红龙）迟宴：“瓦坎达，我们等一下要去城镇了。虽然说，胶液做的衣服确实有些高等冒险者会使用，但是毕竟您没有证件我们也很难办啊。”
（白狼）夏天：“内个，你要是不嫌弃，我这里有备用的衣服。”夏天从空间背包中拿出一套朴素的探险装，宽大的尺码对于健壮的你来说勉强能用，你将面罩摘下来别在腰间从外表来看，和普通的冒险者差不多。
“对了瓦坎达先生，你不是说你没地方可去吗，要不加入我们的旅行团？”
在异世界的好处是，没有人会怀疑你的出生，但是会质疑你的地位，特别是你这位实力高强却没有证件的人，现在你急需一个收入来源来保证自己的生活，面前的探险者小队差不多可以凑合凑合，让这群异世界的土著见识一下黑胶科技的强大吧！
————————————————
「快速传送」
再次睁眼，你们已经到达了一个中世纪风格的小镇。
在短暂休整之后，通过大型传送阵来到了他们的主城。
——翡缇亚兰城
（红龙）迟宴：“我先和老大一起去收上次狩猎魔物的报酬，你先带他去办一下执照吧！”
在经历了一些琐碎的测试之后，你尽力保证成绩不高不低不会被注意的那种程度，你可不想在这种地方惹上麻烦。
“鉴于您的成绩，目前能选择最好的是以下职业”：
->  1_Select_Your_Career

=== 1_Select_Your_Career
*   猎手（刺客）
*   情报官
        TODO
        （还没有开发。）
        ->  1_Select_Your_Career
*   骑士
        TODO
        （还没有开发。）
        ->  1_Select_Your_Career
*   魔导士
        TODO
        （还没有开发。）
        ->  1_Select_Your_Career
*   ？
        TODO
        （还没有开发。）
        ->  1_Select_Your_Career
        
-   接下来就是该解决住宿问题了。
（蓝狐）赫德莱恩：“喂瓦坎达，你刚来这边，应该还没有住所吧，如果不嫌弃你可以去我们的据点看看，顺带，这是分你的报酬，因为只是狩猎中型魔物，所以只有这一点点。”
【获得】金钱：500G
你跟随着他们向郊外走去，最后在城镇的外围找到了一间朴素的房屋。
（红龙）迟宴：“这就是我们的据点了，原本二楼有两个房间，现在另一个是你的了”
“你们呢？”
（蓝狐）赫德莱恩：“我们有自己的住所，这个地方只是我们集合的的地方，不过夏天平时是住这里的。”说完他看了看衣着朴素的夏天，漏出一丝怜悯的神色。
————————————————
回到了房间你简单的收拾了一下这里的物品，另外两个人也回去了。
->  Choose1
    =   Choose1
    *   问夏天今后的事情
            TODO
            （还没有开发。）
            ->  Choose1
    *   出去查看树林
            ->  1_Visit_Forest
    *   外出逛逛
            TODO
            （还没有开发。）
            ->  Choose1
    *   叫夏天一起出去逛
            TODO
            （还没有开发。）
            ->  Choose1

=== 1_Visit_Forest
待在住所也没事做，还不如出去走走。
据点周围是一片森林，属于城镇外围，树林边上放着一块告示牌，上面写着一些杂七杂八的东西，如半夜三更奇怪的仪式，突然出现的史莱姆痕迹之类的。
抛开奇奇怪怪的东西不谈，这片安静的树林还是让人感到安心的。
走进树林，你环视了一圈周围的景象，采集了一些看起来无害的野果放进嘴里嚼了嚼，酸的皱眉。在随便看了一圈后，你返回了住所。
在你回去的时候，你看见夏天和一个人对话。
村民：“事情就是这样，最近总是有奇怪的东西在半夜在糟蹋庄稼，所以需要你去帮忙看看。”
（白狼）夏天：“我知道了，我会去封印那边看看的，半夜袭击村庄的野兽吗……麻烦他们刚回去。”
村民交代完事情后就走了，夏天他也连忙收拾东西，看见你过来之后叹了一口气：“回来的刚好，我需要你陪我去看一下驱逐野兽的封印，当然你要是去做别的的话也可以。”
->  Choose1
    =   Choose1
    *   [接取任务，陪同他一起去]
            ->  Accept_Togethe
    *   不去我还有别的事要做
            TODO
            （还没有开发。）
            ->  Choose1
    *   你不用去，我自己来
            TODO
            （还没有开发。）
            ->  Choose1
=== Accept_Togethe
你揉了揉他的头，表示了同意，随即和他一起走进了森林。
（白狼）夏天：“一般来说这些野兽不会乱来，除非是周围的封印法阵松动啥的，但是一般不可能，而且黑胶生物暂时智商普遍不高，就算进来了也拿封印没办法，除非它们像你一样块头又高，智商又高，否则他们进不来这里。一般这种胶液生物都在魔王军那里，怎么可能出现在这里？”
你突然感到压力倍增，擦了一下额头流出来的“汗”。
————————————————
到了封印周围，你却感到一丝躁动，感觉周围有什么东西呼喊你，原本与公司断开的通讯发出刺耳的声音，你甩了下头跟上夏天的步伐。
夏天的耳朵动了动，似乎察觉到了什么，他也拿起法杖随时做好战斗准备。
封印石的周围，你看见一位半身被黑胶覆盖的鬣狗，你本能的对面前的人感到敌意。
就是现在，上！
冰凌在空中生成，形成严密的弹幕朝着狗进攻，你在一波弹幕过后，闪身上前，一脚踹开对着封印做手脚的狗。
被踹开的狗在地上滚了两圈后停下，抖掉身上的冰凌“我以为是谁，桀桀桀，两个普通的冒险者而已，来吧，对我随便攻击！”
你差不多也看出来了，这个人只是寄生在面前可怜兽人尸体上的胶液罢了，他的本体估计就在某个地方躲着。
狗的身体渐渐的腐败：“我亲爱的朋友，我们本应该是同伴，您这是何苦呢？”
眼看事情败露，这团胶液也打算用这种方式逃开，他的身体扭曲腐烂成黑胶养料，最后聚合成一团黑胶球。
（白狼）夏天：“快躲开！他这是打算自爆！”
他刚说完，黑胶球就开始开裂，粘液带着冰锥炸开，向四周发射，你只能拉着面前的人压在身下，尝试护住他。
算是好运，只是有些许冰锥扎入了背部的皮肉，除此之外别人并没有什么问题。
“没事吧？”你看着夏天。
他的眼睛带着惊恐，倒影着被划伤的你。
你的伤口正汩汩的流淌着黑胶。
他将你推开，将四周试图逃窜的还有活性的黑胶冻结收集起来，手忙脚乱的处理着被污染的封印，以至于他没有发现自己身上也因为爆炸溅到了一身粘液。
他冷冷的撇了一眼你，魔杖指着躺在地上的自己“你不起来吗？走了。”
你们一前一后的走着，路上一言不发，快到的时候，夏天停下了脚步“你救了我两次，我不说什么，你的事情也不会过问太多，希望我们不是敌人。”
回到住所后，夏天匆忙的收拾好衣物，随便擦干净身体，坐在你的对面与你对峙着。
->  Choose1
    =   Choose1
    *   坦白
            TODO
            （还没有开发。）
            ->  Choose1
    *   装作无事发生与往常一样
            TODO
            （还没有开发。）
            ->  Choose1
    *   姦（强奸他）
            ->  1_Rape_XiaTian
=== 1_Rape_XiaTian
夏天收好衣服，快步走进了浴室，你也紧随其后，夏天将自己埋在放好水的浴池之中，没有发现背后潜伏着的你，你一丝不挂的靠近他，坐在他身后。
夏天突然受到惊吓，猛的跳起，但是被你拉回来。
“小狼，怕什么刚刚不是很勇吗，之前还躺我背上，现在怕什么”你轻轻的揉他的脸。
温热的大腿夹着后背，夏天明显不舒服的往前不舒服的往前想跑，但是被黏糊糊的胶液拉回去。
黑胶锁包顶在夏天的后背。
“这里就只有我们两个人，你不觉得要做些什么吗？”
夏天停下了挣扎，回头看着你”真的……要吗？”
你稍微的松开了手，认真的看着他。
「空间移动」
“我就知道你你不安好心，变态！”夏天急忙穿好衣服，跑回房间
“果然是小屁孩，吓一吓就炸毛了。”
————————————————
半夜，夏天确定了家里的黑胶怪物终于休息去了，松口气的回到了浴室，重新准备好热水之后躺了进去，虽然说自己对他并没有敌意，但是还是觉得不太好，毕竟第一次和别人如此的贴近，无论是谁遇到这种事情都会跑吧？
但是，如果他是认真的话，说不定可以试试……
他躺在浴池中，别过头羞红的看着自己身体的变化，粉嫩的肉棒在水中挺立着，上面附着着几滴胶液，等等，这是什么？！
“结果还是忍不住欲望”

你从阴暗处走出来，蹲在夏天头旁边的岸上，感到罪恶的夏天羞涩的想要起身，但是被你这只强壮的黑豹一把抱起。
“我刚刚可是，听到了你说的东西呢~”
夏天就这样被一直奇怪的方式抵在墙上手撑着浴池的石墙，腿被你抓着。
你将滴落着胶液的面罩给他带上，胶液顺着口鼻注入他的体内让他暂时的冷静下来，你的一只手按在他的后穴，分泌的胶液润滑着他的后穴为他的第一次扩张，锁包解开束缚，放出了里面的巨兽。
夏天闭上眼睛，身体颤抖着，黑胶肉棒缓慢的插入，玩弄着他的后穴。
他仰着头，被面罩堵着的口中发出含糊不清的声音，小腹被巨物顶出明显的形状。此时的他就像是被驯服的犬类，仍由你玩弄，你加快速度，肉棒粗鲁地进出他的后穴，看他被自己的巨物操到翻白眼。
你用力的一顶，黑胶在巨物中喷涌，注入白狼的后穴，白狼呜咽的挣扎肉棒射出了自己的纯真。
夏天的肚子被胶精撑的滚圆，你摘下他的面罩，看着他无助的样子。
->  NEXT
    =   NEXT
    *   带会房间胶了
                TODO
            （还没有开发。）
            ->  NEXT
    *   帮他处理一下送他回去
            你的肉棒不舍地抽出，巨物脱出的同时，夏天肚子里装不下的胶液也从后穴吐了出来，你帮助他一点点把残余的胶精排干净后随便清洗了一下自己和他，随后将他带回了房间。
            【获得成就】浴室精混？
            回到房间后，夏天裹紧被子，将自己缩成一团选择装死。
            ->  1_Back_To_Room
=== 1_Back_To_Room
*   小东西没礼貌，是不是想被胶了！
        TODO
        （还没有开发。）
        ->  1_Back_To_Room
*   离开房间
        TODO
        （还没有开发。）
        ->  1_Back_To_Room
*   扯过被子，和他睡一起
        你看他他这个样子，干脆往床上一躺，将他的被子抢过来，显然，这个小家伙不会那么老实。你盖上被子，将他搂进怀里，下巴压在他身上。
        效果显著，这一晚上你们就这样维持着这种姿势。
        ->  1_CP_End1
*   回到自己房间
        TODO
        （还没有开发。）
        ->  1_Back_To_Room
->  END

=== 1_End1
————————————————
GAME OVER
————————————————
【结局】内战幻神の陨落
+   [“是他们……先动手的……”（返回上一个选项）]
        又在胡思乱想了。你摇了摇头。
        ->  1_Keep_Running.Choose2

=== 1_CP_End1
————————————————————————————————
【进度成就】深液豹社：第一章结束
->  2_ASTNWX_New_Day

























->  END