=== 2_ASTNWX_New_Day
————————————————
隔天早晨，阳光透过窗户照射在你的脸上，睁开眼就看到某个白色的东西因为怕冷而面朝你的怀里钻，估计是昨晚剧烈的活动，他到现在还没有清醒的样子。
你就这样保持着这种姿势，感受怀中的人在你胸腔的呼吸，根据他们昨天的说法，处理完委托后，他们需要休整一段时间，所以暂时不会有人突然闯进来打扰你们，你缓慢的起身尽量不改变姿势的坐起来。
->  Choose1
    =   Choose1
    *   把他放回去，让他好好的休息
            TODO
            （还没有开发。）
            ->  Choose1
    *   好机会，我要狠狠地开摸
            TODO
            （还没有开发。）
            ->  Choose1
    *   [躺回去接着睡]
            反正今日也无事可做，不如接着睡觉，你搂住怀中的人接着躺在床上，他都没醒，我凭什么醒。
            不知道过了多久，你感到胸口似乎有什么东西在乱动，你低头一看，看见了睡眼惺忪的夏天，就这样，他和你尴尬的对视着。你就这样看着他的脸变得通红然后铁青，最后推搡着想要离开你的环抱。.
            他拽过被子，想尽办法远离你，被子捂住自己的下半身，试图慢慢的挪动来逃开你的视野，你也这样子看着他。
            “看什么看，我又不会吃了你。”你坐起来打了个哈欠，转念一想亮了一下自己的胶液爪子“至少现在不会。”
            夏天随便翻找一套自己的衣服之后，头也不回地尝试跑出房间，但是被你折腾了一晚上，现在恐怕是站起来的力气都没有了。
            你赤裸着身体，不紧不慢的走下床将倒在地上的夏天提起来，放回床上。
            ->  Choose2
    *   可爱，香草
            TODO
            （还没有开发。）
            ->  Choose1
    =   Choose2
    *   吓唬小孩，好玩
            TODO
            （还没有开发。）
            ->  Choose2
    *   帮他处理一下早上的“事情”
            TODO
            （还没有开发。）
            ->  Choose2
    *   知道怕了还不快来服侍本大爷
            TODO
            （还没有开发。）
            ->  Choose2
    *   安抚他
            你看着坐在床上，一脸犯错样的白狼，开始对刚才吓唬小孩的行为感到内疚。虽然说吓唬小孩不好，但是谁叫他主动“邀请”自己呢。
            为自己想好开脱的理由后，你不急不躁的爬过去，伸手试探的摸在他的头上，他禁闭着眼睛不太接受却也没有拒绝，既然这样那你也不客气，像是安抚小孩一样抚摸着他的头。你向下看去——
            察觉他一直捂住下体的动作，了解了他的异样，你只是稍微看了一眼就知道发生了什么，不过你还是尽可能给足了面子，穿好衣服下楼等他。
            你坐在靠窗的椅子上，随便拿起柜子上的书籍随便看看，高等魔法基础知识之类的你直接跳过，这种东西现在你可看不进去，你翘着二郎腿，翻阅着应该是报纸的东西：吃人的黑胶怪物，模仿人类的怪异生物，野外出现的腐化法阵……应该算是新闻，毕竟是异世界，被姦了不懂反抗的人都有何况是这种异常现象，你瞄了一眼下面的委托栏：
            ————————————————
            「秋季收获活动」报酬中规中矩，而且只是采摘农作物啥的应该挺简单。
            「万灵遗迹开放」只有在秋季才会出现的古城。遗迹探索，拿到什么全看运气，不知道为什么被设置成高危。
            「夜间巡逻」日结，巡逻郊区，自行准备装备。
            ……
            ————————————————
            在你随便翻看着报纸，这时候夏天也下来了坐在你的对面。
            ->  Choose3
    =   Choose3
    *   选择一件委托
            TODO
            （还没有开发。）
            ->  Choose3
        **   选择收获作物委托
                TODO
                （还没有开发。）
                ->  Choose3
        **   选择遗迹探索委托
                TODO
                （还没有开发。）
                ->  Choose3
        **   选择夜间巡逻委托
                TODO
                （还没有开发。）
                ->  Choose3
    *   [调戏夏天]
            虽然说，白日宣淫不太好，但是目你前自己能做的事情好像都和他有关，你不怀好意的凑近夏天，他本能的抱住自己的的尾巴保护自己。你没做什么，只是低下头看着他。
            被你一直盯着，让他感到害羞，你俯下身子，赤裸的上身诱惑着他。你看着他的面色变得潮红，贴身的衣服被下体顶起一个鼓包。
            你像是恶魔一样，勾引着他犯下错误。
            ->  Choose4
    *   自行探索郊区
            TODO
            （还没有开发。）
            ->  Choose3
    *   待在家里什么都不做
            TODO
            （还没有开发。）
            ->  Choose3
    =   Choose4
        *   将他带回房间
                TODO
                （还没有开发。）
                ->  Choose4
        *   就地把他办了
                TODO
                （还没有开发。）
                ->  Choose4
        *   扒光他的衣服，羞辱他    
                TODO
                （还没有开发。）
                ->  Choose4
        *   [装作没事，放置 Play]
                看着他这幅样子，你低下头，舌头顺着他微微张开的嘴滑入他的口腔，与上次不同，这次他意外的温顺，即使你的胶液舌头估计的缠绕着他的，他也没有过多抗拒，在确定给他喂入一定量的胶液都被他吞下去后，你停下来这个黏腻的吻，你的“人性”还不允许你在大白天的强姦一个误入歧途的屁孩。
                夏天发愣的坐在椅子上，眼神空洞中带有一些不舍，没有意识到刚刚接吻时残留在舌尖上黏腻的胶液，你推开门，毫不在意的放任他留着家中，束手无策的看他自己的变化。
                在调戏完他之后，你思索着以后该怎么处(gong)理(lve)他，不过看他这个样子，估计过不了多久就该主动投怀送抱了吧。你思索着后面该怎么对待他，关上了门消化了一下接吻时读取到的记忆。
                【学会技能】体力汲取
                【学会技能】冰系魔法 - 初级
                ————————————————
                既然出了门，那就……
                ->  PAUSE
                ->  2_Go_To
                
=== 2_Go_To
*   去树林里随便抓点魔物提升等级
        ->  2_Go_To
*   去河边实验自己新学会的魔法
        ->  2_Go_To
*   将夏天抓出来陪自己联系技能
        ->  2_Go_To
*   前去结界附近查看
        ->  2_Go_To
            
            
            
            
            
            
            
            
            
            


->  END